{
  "Empowering Mothers, Nurturing Futures": "Mmaatan a wɔhyɛ wɔn den, daakye a wɔhwɛ ma ɛyɛ yie",
  "Evidence-based maternal care for a healthier Ghana.": "Ɔhwɛ a egyina adanse so ma Ghana a ɛwɔ apɔwmuden",
  "Login": "Kɔ mu",
  "Sign Up": "Kyerɛw din",
  "Sign in to your account": "Kɔ wo akɔnt mu",
  "Email address": "Email adrɛɛse",
  "Password": "Asumasɛm",
  "Don't have an account? Sign up": "Wonnim akɔnt? Kyerɛw din",
  "Sign in": "Kɔ mu",
  "Create a new account": "Yɛ akɔnt foforo",
  "Confirm password": "Si asumasɛm so dua",
  "Already have an account? Sign in": "Wowɔ akɔnt dedaw? Kɔ mu",
  "Passwords do not match": "Asumasɛm no nhyia",
  "Pregnancy Progress": "Afunmu Nkɔsoɔ",
  "Doc's Tips": "Dɔkota Afotuo",
  "for 3rd Trimester": "ma Nsɛnsɛm a Ɛtɔ so Mmiɛnsa",
  "Video": "Video",
  "Pregnancy Gymnastics": "Afunmu Apɔmutenetene",
  "Analysis": "Nhwehwɛmu",
  "for Week": "ma Nnawɔtwe",
  "Echocardiography": "Echocardiography",
  "Myth": "Anansesɛm",
  "Fact": "Nokwasɛm",
  "Source": "Nsɛm a ɛwɔ mu",
  "Click to Read": "Mia so kenkan",
  "Debunking Pregnancy Myths": "Yɛreyi Nsɛm a Ɛnyɛ Nokware wɔ Nyinsɛn Ho",
  "You should eat for two during pregnancy.": "Ɛsɛ sɛ wodi aduan ma nnipa baanu bere a woyem.",
  "Pregnant women only need about 300 extra calories per day in the second and third trimesters, not double the food.": "Mmaa a woyem hia kalori 300 pɛ a wɔde ka ho da biara da wɔ trimester a ɛtɔ so mmienu ne mmiɛnsa mu, na ɛnyɛ aduan mmɔho abien.",
  "Morning sickness only happens in the morning.": "Anɔpa ayare nso sisi anɔpa nkutoo.",
  "Nausea and vomiting can occur at any time of the day during pregnancy.": "Nausea ne fɛre bɛtumi aba bere biara wɔ da no mu wɔ nyinsɛn bere mu.",
  "Pregnant women should avoid all exercise.": "Ɛnsɛ sɛ mmaa a woyem yɛ apɔw-mu-teɛteɛ biara.",
  "Moderate exercise is safe and beneficial during most pregnancies unless advised otherwise by a healthcare provider.": "Apɔw-mu-teɛteɛ a ɛnyɛ den yɛ nea ahobammɔ wom na mfaso wɔ so wɔ nyinsɛn dodow no ara mu gye sɛ ɔhwɛfoɔ a ɔhwɛ apɔwmuden ka sɛ yɛnyɛ no.",
  "Heartburn means the baby will have lots of hair.": "Ɔkɔm a ɛde nsensanee ba no kyerɛ sɛ abofra no benya ti nhwi pii.",
  "Heartburn is caused by hormonal changes and stomach pressure, not directly linked to a baby's hair growth.": "Nneɛma a ɛde ɔkɔm a ɛde nsensanee ba ne nneɛma a ɛwɔ yafunu mu a ɛsesa, na ɛne abofra ti nhwi a ɛnyin nni abusuabɔ tẽẽ.",
  "You cannot dye your hair while pregnant.": "Wuntumi nsiesie wo ti nhwi bere a woyem.",
  "Occasional hair dye use is generally considered safe, especially after the first trimester, but consult your doctor.": "Mpɛn pii no, wosusuw sɛ ti nhwi a wɔde di dwuma bere ne bere mu no yɛ nea ahobammɔ wom, titiriw wɔ trimester a edi kan no akyi, nanso bisa wo dɔkota.",
  "You should avoid all seafood during pregnancy.": "Ɛsɛ sɛ wotwe wo ho fi nsu mu nnuan nyinaa ho wɔ nyinsɛn bere mu.",
  "Low-mercury fish like salmon and sardines are safe and provide important nutrients such as omega-3 fatty acids.": "Nsu mu nnuan a mercury nnim pii te sɛ salmon ne sardines yɛ nea ahobammɔ wom na ɛma nnuan a ehia te sɛ omega-3 fatty acids.",
  "Spicy foods can induce labor.": "Nnuan a ɛyɛ hyew betumi ama obi awo.",
  "There’s no scientific evidence that spicy foods trigger labor.": "Nyansahu mu adanse biara nni hɔ a ɛkyerɛ sɛ nnuan a ɛyɛ hyew na ɛma obi awo.",
  "Pregnant women should avoid flying.": "Ɛnsɛ sɛ mmaa a woyem tu wimhyɛn.",
  "Flying is generally safe until the last month of pregnancy, though long flights may increase risk of blood clots.": "Wimhyɛn a wotu no yɛ nea ahobammɔ wom araa de kosii nyinsɛn bosome a etwa to no mu, ɛwom sɛ wimhyɛn a wotu kyɛ betumi ama mogya a ɛtumi bɛba no yɛ kɛse de.",
  "Carrying high or low predicts the baby’s gender.": "Sɛ woso yafunu kɔ soro anaasɛ ɛba fam a, ɛkyerɛ abofra no bɔbeasu.",
  "Belly shape depends on muscle tone, body type, and baby’s position—not gender.": "Yafunu nsusuwso gyina ntini ahoɔden, nipadua su, ne abofra no tebea so—na ɛnyɛ ɔbarima ne ɔbea nna.",
  "Pregnant women should avoid sleeping on their left side.": "Ɛnsɛ sɛ mmaa a woyem da wɔn benkum so.",
  "Sleeping on the left side is actually recommended as it improves blood flow to the baby.": "Wɔkamfo kyerɛ sɛ obi nna ne benkum so efisɛ ɛma mogya kɔ abofra no nipadua mu yiye.",
  "Cravings reveal what nutrients the baby needs.": "Aduan a ɛyɛ dɛ a obi kɔn dɔ no da nnuan a abofra no hia adi.",
  "Cravings are common but not reliable indicators of nutritional needs.": "Aduan a ɛyɛ dɛ a obi kɔn dɔ no abu so nanso ɛnyɛ nnuan a ehia a wotumi de ho to so no nkyerɛkyerɛmu.",
  "You cannot drink coffee while pregnant.": "Wuntumi nnom kɔfe bere a woyem.",
  "Moderate caffeine intake (under 200 mg per day) is considered safe during pregnancy.": "Wosusuw sɛ caffeine a wɔnom no nnnu 200 mg da biara da no yɛ nea ahobammɔ wom wɔ nyinsɛn bere mu.",
  "All herbal teas are safe in pregnancy.": "Nnuru a wɔde yɛ tii nyinaa yɛ nea ahobammɔ wom wɔ nyinsɛn mu.",
  "Some herbal teas may be unsafe; always check with a healthcare provider before consuming.": "Nnuru a wɔde yɛ tii binom betumi ayɛ nea ahobammɔ nnim; bere biara hwɛ nea ɔhwɛ apɔwmuden ansa na woanom.",
  "You can’t have any sugar while pregnant.": "Wuntumi nni asikyire biara bere a woyem.",
  "Moderation is key; occasional treats are fine as part of a balanced diet.": "Nneɛma a wɔyɛ no ɔkwan a ɛfata so no ho hia; nneɛma a wɔyɛ no bere ne bere mu no yɛ papa sɛ aduan a ɛkari pɛ no fa.",
  "Pregnant women must avoid baths.": "Ɛsɛ sɛ mmaa a woyem twe wɔn ho fi aguare ho.",
  "Warm baths are safe; only hot tubs and saunas should be avoided due to overheating risks.": "Aguare a ɛyɛ hye yɛ nea ahobammɔ wom; ɛsɛ sɛ wɔtwe wɔn ho fi nsu mu hyew ne sauna a wɔde guare mu nkutoo esiane ɔhyew a ɛboro so a ɛwɔ mu nti.",
  "Stretch marks can always be prevented.": "Bere biara, wotumi siw stretch marks ano.",
  "Genetics and skin type play a big role; creams may help but cannot guarantee prevention.": "Awoɔ ne nipadua su di dwuma kɛse; nnuru a wɔde sra nipadua no betumi aboa nanso entumi nsi so dua sɛ wobesiw ano.",
  "Pregnancy brain isn’t real.": "Nyinsɛn adwene nyɛ nokware.",
  "Hormonal changes and sleep disturbances can affect memory and focus during pregnancy.": "Nneɛma a ɛsesa wɔ nipadua mu ne nna a ɛnteɛ betumi aka nkae ne adwene a wɔde susu nneɛma ho wɔ nyinsɛn bere mu.",
  "Heart rate can predict a baby’s gender.": "Akoma a ɛbɔ no betumi akyerɛ abofra bɔbeasu.",
  "There’s no evidence linking fetal heart rate to gender.": "Adanse biara nni hɔ a ɛkyerɛ sɛ akoma a ɛbɔ no ne ɔbarima ne ɔbea nna wɔ abusuabɔ.",
  "Pregnant women cannot get vaccinated.": "Mmaa a woyem ntumi nnya nnuru a wɔde bɔ wɔn ho ban.",
  "Some vaccines, like flu and Tdap, are recommended and protect both mother and baby.": "Wɔkamfo nnuru a wɔde bɔ ho ban binom te sɛ flu ne Tdap kyerɛ na ɛbɔ ɛna ne abofra no nyinaa ho ban.",
  "Lifting your arms above your head can harm the baby.": "Sɛ woma wo nsa so kɔ soro a, ebetumi apira abofra no.",
  "There is no scientific basis for this belief; normal movement is safe.": "Nyansahu mu nnyinaso biara nni hɔ a ɛma wogye eyi di; sɛ obi yɛ ade a ɛte saa a, ahobammɔ wom.",
  "Pregnant women should avoid all dairy.": "Ɛsɛ sɛ mmaa a woyem twe wɔn ho fi nufusu mu nneɛma nyinaa ho.",
  "Pasteurized dairy products are safe and provide calcium and protein.": "Nufusu mu nneɛma a wɔayɛ no pasteurized no yɛ nea ahobammɔ wom na ɛma calcium ne protein.",
  "Cesarean delivery is the easier option.": "Awo a wɔde twa nipadua no mu na ɛyɛ mmerɛw.",
  "C-sections are major surgeries with risks; recovery can be longer compared to vaginal birth.": "C-section yɛ oprehyɛn akɛse a asiane wom; ɛho a wotumi nya wo ho no betumi akyɛ sen awo a wɔtaa wo.",
  "You cannot have sex during pregnancy.": "Wuntumi nna mmarima mu wɔ nyinsɛn bere mu.",
  "Sex is safe for most pregnancies unless a doctor advises otherwise.": "Mmarima a wɔne wɔn nna no yɛ nea ahobammɔ wom ma nyinsɛn dodow no ara gye sɛ dɔkota ka sɛ yɛnyɛ no.",
  "Pregnant women should avoid vaccinations altogether.": "Ɛsɛ sɛ mmaa a woyem twe wɔn ho fi nnuru a wɔde bɔ wɔn ho ban no ho koraa.",
  "Vaccines like flu and whooping cough are safe and recommended to protect mother and baby.": "Nnuru a wɔde bɔ ho ban te sɛ flu ne pertussis yɛ nea ahobammɔ wom na wɔkamfo kyerɛ sɛ wɔmfa nbɔ ɛna ne abofra no ho ban.",
  "Labor always starts with water breaking.": "Bere biara awoɔ hyɛ aseɛ denam nsuo a ɛpae so.",
  "Only about 15% of women experience water breaking as the first sign of labor.": "Mmaa 15% pɛ na wohu sɛ nsu a ɛpae ne awo ho sɛnkyerɛnne a edi kan.",
  "Pregnant women should avoid pets.": "Ɛnsɛ sɛ mmaa a woyem ne mmoa a wɔtete wɔn no bɔ.",
  "Pets are safe; only cat litter poses risk due to toxoplasmosis.": "Mmoa a wɔtete wɔn no yɛ nea ahobammɔ wom; agyinamoa nwura nkutoo na asiane wom esiane toxoplasmosis nti.",
  "Belly size shows baby’s health.": "Yafunu kɛse kyerɛ abofra apɔwmuden.",
  "Belly size varies by body type and doesn’t reliably indicate baby’s size or health.": "Yafunu kɛse gyina nipadua su so na ɛnkyerɛ abofra kɛse anaa apɔwmuden yiye.",
  "You must avoid cheese during pregnancy.": "Ɛsɛ sɛ wotwe wo ho fi cheese ho wɔ nyinsɛn bere mu.",
  "Only unpasteurized soft cheeses should be avoided; pasteurized cheeses are safe.": "Ɛsɛ sɛ wɔtwe wɔn ho fi cheese a ɛyɛ mmerɛw a wɔanyɛ no pasteurized no ho nkutoo; cheese a wɔayɛ no pasteurized no yɛ nea ahobammɔ wom.",
  "Pregnant women should avoid all medications.": "Ɛsɛ sɛ mmaa a woyem twe wɔn ho fi nnuru nyinaa ho.",
  "Some medications are safe; always consult a healthcare provider before taking any.": "Nnuru binom yɛ nea ahobammɔ wom; bere biara bisa oduruyɛfo ansa na woanom bi.",
  "Eating peanuts during pregnancy causes allergies.": "Peanut a wodi wɔ nyinsɛn bere mu no de yareɛ a ɛma nipadua no yɛ basaa no ba.",
  "Eating peanuts in pregnancy does not increase allergy risk and may even reduce it.": "Peanut a wodi wɔ nyinsɛn bere mu no mma asiane a ɛwɔ hɔ sɛ obi benya yareɛ a ɛma nipadua no yɛ basaa no nyɛ kɛse na ebetumi mpo atew so.",
  "About PreggsCare": "Fa PreggsCare Ho",
  "At PreggsCare, we believe every mother deserves compassionate, informed, and holistic support during pregnancy and beyond. Our mission is to empower expectant mothers with expert guidance, personalized care, and access to vital health resources.": "Wɔ PreggsCare, yegye di sɛ ɛna biara fata mmɔborɔhunu, nimdeɛ, ne mmoa a edi mũ wɔ nyinsɛn ne awo akyi. Yɛn botae ne sɛ yɛbɛhyɛ mmaa a woyem den denam akwankyerɛ a animdefo de ma, ɔhwɛ a wɔde ma obiara, ne hokwan a wobenya anya apɔwmuden ho nneɛma a ɛho hia so.",
  "From prenatal check-ups and nutrition advice to emotional wellness and postnatal support, we are here to walk with you every step of the way ensuring a safe, healthy, and joyful journey into motherhood.": "Efi awoɔ mu nhwehwɛmu ne aduan ho afotu so kosi nkate mu yiyedi ne awo akyi mmoa so no, yɛwɔ ha sɛ yɛne wo bɛnantew anammɔn biara a ɛbɛma woanya akwantu a ahobammɔ wom, apɔwmuden wom, na anigye wom akɔma ɛna su mu.",
  "For informational purposes only, please seek medical advice from qualified professionals.": "Sɛ wopɛ nsɛm a ɛfa ho nkutoo a, yɛsrɛ wo hwehwɛ ayaresabea afotu fi nnipa a wɔfata hɔ.",
  "Learn More": " Sua Pii",
  "PreggsCare is your trusted digital companion for a healthy and informed pregnancy journey. Designed with expecting mothers in mind, our platform empowers you with the tools, resources, and guidance you need to take care of yourself and your growing baby every step of the way.": "PreggsCare yɛ wo digital hokafo a wotumi de wo ho to so ma akwantu a apɔwmuden wom na wonya ho nimdeɛ. Wɔayɛ no a ɛwɔ mmaa a woyem wɔ wɔn adwenem, yɛn platform no hyɛ wo den denam nnwinnade, nneɛma, ne akwankyerɛ a wuhia na ama woahwɛ wo ho ne wo ba a ɔrenyin no yiye wɔ anammɔn biara mu so.",
  "With PreggsCare, you can:": "Sɛ wowɔ PreggsCare a, wubetumi:",
  "Track Your Health: Easily log and monitor your weight, symptoms, and other pregnancy indicators.": "Di w’apɔwmuden akyi: Kyerɛw wo mu duru, yareɛ nsɛnkyerɛnne, ne nyinsɛn ho nkyerɛkyerɛmu afoforo gu savings so na di akyire yiye.",
  "Learn & Stay Informed: Access expert-backed tips and articles on nutrition, exercise, emotional wellness, and prenatal care.": "Sua & Tra Nimdeɛ: Nya nimdefoɔ afotu ne nsɛm a ɛfa aduane pa ho, apɔw-mu-teɛteɛ, nkate mu yiedie, ne awoɔ mu ɔhwɛ ho.",
  "Holistic Wellness: Explore focused guidance on essential areas such as nutrition, physical activity, rest & sleep, emotional well-being, and baby development milestones.": "Ahunmu Yiyedi a Edi Mu: Hwehwɛ akwankyerɛ a wɔde wɔn adwene si so wɔ afa horow a ehia te sɛ aduane pa, nipadua mu dwumadi, ahomegye ne nna, nkate mu yiyedi, ne nkokoaa nkɔso nsɛnkyerɛnne a ɛho hia.",
  "Stay Motivated: Engage with daily inspiration and small, achievable goals to keep you feeling positive and supported.": "Kɔ so ara nya nkuranhyɛ: Fa wo ho hyɛ daa nkuranhyɛ ne botae nketenkete a wotumi yɛ mu na ama woate nka sɛ woyɛ papa na wotaa wo akyi.",
  "Plan Your Care: Receive personalized reminders for appointments, supplements, and healthy habits.": "Yɛ w’ahwɛ ho nhyehyɛe: Nya nkae a wɔde ma wo pɔtee a ɛfa appointments, nnuan a wɔde ka aduan ho, ne su pa a ɛma apɔwmuden ho.",
  "Whether it's your first pregnancy or your third, PreggsCare helps you feel confident, connected, and cared for right from your phone. Your journey matters, and with PreggsCare, you'll never walk it alone.": "Sɛ ɛyɛ wo nyinsɛn a edi kan anaa nea ɛto so abiɛsa no, PreggsCare boa wo ma wunya ahotoso, wo ne afoforo di nkitaho, na wɔhwɛ wo fi wo fon so pɛɛ. W’akwantu no ho hia, na sɛ wowɔ PreggsCare a, wunantew nkutoo da.",
  "Close": "To mu",
  "Frequently Asked Questions": "Nsɛmmisa a Wɔtaa Bisa",
  "What are the most important nutrients during pregnancy?": "Nnuan pa bɛn na ɛho hia paa wɔ nyinsɛn mu?",
  "Folate, iron, calcium, vitamin D, DHA (omega-3), and protein are crucial for your baby's development and your health. They support everything from preventing birth defects to building strong bones.": "Folate, iron, calcium, vitamin D, DHA (omega-3), ne protein ho hia paa ma wo ba no nkɔso ne w’apɔwmuden. Wɔboa biribiara fi awo mu dɛmdi a wosiw ano so kosi nnompe a ɛyɛ den a wosi so.",
  "How can I manage morning sickness?": "Mɛyɛ dɛn na madi anɔpa yare so?",
  "Try eating small, frequent meals. Ginger tea or chews can help. Avoid an empty stomach and choose bland foods like crackers or toast. If it's severe, talk to your doctor.": "Bɔ mmɔden di nnuan nketenkete mpɛn pii. Ginger tii anaa nea wɔwe no betumi aboa. Twe wo ho fi yafunu a ɛda mpan no ho na paw nnuan a enni dɛ te sɛ krakere anaa toast. Sɛ ɛyɛ den a, wo ne wo dɔkota nkasa.",
  "Is it safe to eat fish during pregnancy?": "So ɛyɛ den sɛ wodi nam wɔ nyinsɛn mu?",
  "Yes, but it's important to choose low-mercury fish like salmon, cod, and tilapia. Aim for 2-3 servings a week. Avoid high-mercury fish like shark, swordfish, and king mackerel.": "Aane, nanso ɛho hia sɛ wopaw nam a mercury nnim pii te sɛ salmon, cod, ne tilapia. Botae ne sɛ wobɛnom nnɔnhwerew 2-3 dapɛn biara. Twe wo ho fi nam a mercury pii wom te sɛ shark, swordfish, ne king mackerel ho.",
  "How much weight should I gain during pregnancy?": "Mɛyɛ dɛn na manya mu duru wɔ nyinsɛn mu?",
  "It depends on your pre-pregnancy weight. Most women with a normal BMI should gain 25-35 pounds. Your doctor will give you a personalized recommendation.": "Egyina wo mu duru a na wowɔ ansa na woyem no so. Mmea dodow no ara a wɔn BMI yɛ normal no, ɛsɛ sɛ wɔn mu duru kɔ soro kilogram 25-35. Wo dɔkota de akwankyerɛ a wɔde ama wo pɔtee bɛma wo.",
  "About PreggsCare": "Fa PreggsCare Ho",
  "PreggsCare is a comprehensive resource for expectant mothers, providing guidance and support throughout the pregnancy journey.": "PreggsCare yɛ ade a ɛtrɛw a ɛfa mmaa a woyem ho, na ɛde akwankyerɛ ne mmoa ma wɔ wɔn nyinsɛn akwantu no nyinaa mu.",
  "Quick Links": "Nkitahodi a Ɛyɛ Ntɛm",
  "Home": "Fie",
  "Pregnancy Tracker": "Afunmu Nkɔsoɔ Di akyi",
  "Nutritional Guide": "Aduane Pa Ho Akwankyerɛ",
  "Resources": "Nneɛma a Wɔde Di Dwuma",
  "Contact Us": "Di Nkitaho ne Yɛn",
  "Email: support@preggscare.com": "Email: support@preggscare.com",
  "Phone: +233 55 433 822": "Phone: +233 55 433 822",
  "© 2024 PreggsCare. All rights reserved.": "© 2024 PreggsCare. Hokwan nyinaa wɔ yɛn nsam."
}